Revit 2026 API

# Result Enumeration

---

Informs Autodesk Revit of the status of your application after execution.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum Result
```
```vb
Public Enumeration Result
```
```cpp
public enum class Result
```
```fsharp
type Result
```

| Member name | Value | Description |
| --- | --- | --- |
| Cancelled | 1 | Signifies that the external application is cancelled. |
| Failed | -1 | The external application was unable to complete its task. |
| Succeeded | 0 | The external application completed successfully. Autodesk Revit will keep this object during the entire Revit session. |

#### Reference

Autodesk.Revit.UI Namespace